NN_JD_FullCourse/src/InformationRegisters/ObjectsCharacteristicValues/ObjectsCharacteristicValues.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ObjectsCharacteristicValues</name>
  <resources>
    <name>CharacteristicValue</name>
    <type>
      <types>Characteristic.AdditionalAttributesAndProperties</types>
    </type>
  </resources>
  <dimensions>
    <name>Object</name>
    <type>
      <types>CatalogRef.Companies</types>
      <types>CatalogRef.Warehouses</types>
      <types>CatalogRef.Products</types>
      <types>CatalogRef.Counterparties</types>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CharacteristicType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndProperties</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

NN_JD_FullCourse/src/Enums/CharacteristicsObjectTypes/CharacteristicsObjectTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CharacteristicsObjectTypes</name>
  <enumValues>
    <name>Companies</name>
  </enumValues>
  <enumValues>
    <name>Counterparties</name>
  </enumValues>
  <enumValues>
    <name>Contracts</name>
  </enumValues>
  <enumValues>
    <name>Products</name>
  </enumValues>
  <enumValues>
    <name>Warehouses</name>
  </enumValues>
</mdclass:Enum>

NN_JD_FullCourse/src/InformationRegisters/ObjectsCharacteristicValues/Forms/RecordForm/Module.bsl
&AtClient
Var PreviousObjectType;

&AtClient
Procedure ObjectOnChange(Item)
	
	TypeOfObject = TypeOf(Record.Object);

	If PreviousObjectType <> TypeOfObject Then
		Record.CharacteristicType  = Undefined;
		Record.CharacteristicValue = Undefined;
		SetChoiceParametersForCharacteristicType();
		
		PreviousObjectType = TypeOfObject;
	EndIf;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If ValueIsFilled(Record.Object) Then
		Items.Object.Visible = False;
		SetChoiceParametersForCharacteristicType();
	EndIf;
	
EndProcedure

&AtServer
Procedure SetChoiceParametersForCharacteristicType()
		
	ChoiceParameters = New Array();
	
	If Record.Object <> Undefined Then
		NewLink = New ChoiceParameter("Filter.CharacteristicsObjectType", CharacteristicsObjectType());
		ChoiceParameters.Add(NewLink);
	EndIf;
	
	Items.CharacteristicType.ChoiceParameters = New FixedArray(ChoiceParameters);
	
EndProcedure

&AtServer
Function CharacteristicsObjectType()

	TypeOfObject = TypeOf(Record.Object);
	
	If TypeOfObject = Type("CatalogRef.Companies") Then
		Result = Enums.CharacteristicsObjectTypes.Companies;
	ElsIf TypeOfObject = Type("CatalogRef.Counterparties") Then
		Result = Enums.CharacteristicsObjectTypes.Counterparties;
	ElsIf TypeOfObject = Type("CatalogRef.CounterpartyContracts") Then
		Result = Enums.CharacteristicsObjectTypes.Contracts;
	ElsIf TypeOfObject = Type("CatalogRef.Products") Then
		Result = Enums.CharacteristicsObjectTypes.Products;
	ElsIf TypeOfObject = Type("CatalogRef.Warehouses") Then
		Result = Enums.CharacteristicsObjectTypes.Warehouses;
	Else
		Raise "Unexpected type of object: " + TypeOfObject;
	EndIf;

	Return Result;
	
EndFunction
